export const distances = {
  code: 'Ok',
  distances: [
    [
      0,
      2305.2,
      5147.8
    ],
    [
      1861.3,
      0,
      3229.2
    ],
    [
      5401.8,
      4002.3,
      0
    ]
  ],
  destinations: [
    {
      distance: 6.22581341,
      name: 'Castro y Bazán',
      location: [
        -67.491902,
        -29.157397
      ]
    },
    {
      distance: 8.843507891,
      name: 'Juan XXIII',
      location: [
        -67.506482,
        -29.156509
      ]
    },
    {
      distance: 7.932747828,
      name: 'Manzana O',
      location: [
        -67.527528,
        -29.142907
      ]
    }
  ],
  sources: [
    {
      distance: 6.22581341,
      name: 'Castro y Bazán',
      location: [
        -67.491902,
        -29.157397
      ]
    },
    {
      distance: 8.843507891,
      name: 'Juan XXIII',
      location: [
        -67.506482,
        -29.156509
      ]
    },
    {
      distance: 7.932747828,
      name: 'Manzana O',
      location: [
        -67.527528,
        -29.142907
      ]
    }
  ]
};

export const routes = {
  routes: [
    {
      country_crossed: false,
      weight_name: 'auto',
      weight: 1781.013,
      duration: 1627.623,
      distance: 11517.688,
      legs: [
        {
          via_waypoints: [],
          admins: [
            {
              iso_3166_1_alpha3: 'ARG',
              iso_3166_1: 'AR'
            }
          ],
          weight: 427.844,
          duration: 360.116,
          steps: [],
          distance: 1794.379,
          summary: 'Antonia Iribarren, Juan XXIII'
        },
        {
          via_waypoints: [],
          admins: [
            {
              iso_3166_1_alpha3: 'ARG',
              iso_3166_1: 'AR'
            }
          ],
          weight: 503.726,
          duration: 465.349,
          steps: [],
          distance: 3232.148,
          summary: 'Domingo Faustino Sarmiento, Ruta Provincial 14'
        },
        {
          via_waypoints: [],
          admins: [
            {
              iso_3166_1_alpha3: 'ARG',
              iso_3166_1: 'AR'
            }
          ],
          weight: 849.443,
          duration: 802.157,
          steps: [],
          distance: 6491.161,
          summary: 'RP14, Ruta Provincial 14'
        }
      ],
      geometry: {
        coordinates: [
          [
            -67.491901,
            -29.157396
          ],
          [
            -67.492334,
            -29.158541
          ],
          [
            -67.499963,
            -29.155952
          ],
          [
            -67.501197,
            -29.158475
          ],
          [
            -67.506482,
            -29.156509
          ],
          [
            -67.506924,
            -29.156331
          ],
          [
            -67.510239,
            -29.156421
          ],
          [
            -67.510964,
            -29.156345
          ],
          [
            -67.51892,
            -29.152203
          ],
          [
            -67.519132,
            -29.15192
          ],
          [
            -67.519309,
            -29.151782
          ],
          [
            -67.519707,
            -29.151947
          ],
          [
            -67.520156,
            -29.151889
          ],
          [
            -67.523806,
            -29.150378
          ],
          [
            -67.528957,
            -29.147612
          ],
          [
            -67.526125,
            -29.145647
          ],
          [
            -67.527981,
            -29.143482
          ],
          [
            -67.52738,
            -29.143083
          ],
          [
            -67.527527,
            -29.142907
          ],
          [
            -67.528245,
            -29.142063
          ],
          [
            -67.532651,
            -29.145027
          ],
          [
            -67.530253,
            -29.146826
          ],
          [
            -67.525762,
            -29.149424
          ],
          [
            -67.522315,
            -29.151031
          ],
          [
            -67.519519,
            -29.152112
          ],
          [
            -67.519136,
            -29.151999
          ],
          [
            -67.519142,
            -29.151348
          ],
          [
            -67.517416,
            -29.14793
          ],
          [
            -67.517011,
            -29.147422
          ],
          [
            -67.51634,
            -29.14696
          ],
          [
            -67.512808,
            -29.14588
          ],
          [
            -67.506674,
            -29.145948
          ],
          [
            -67.502981,
            -29.145196
          ],
          [
            -67.498521,
            -29.145538
          ],
          [
            -67.497648,
            -29.145805
          ],
          [
            -67.497038,
            -29.146373
          ],
          [
            -67.49557,
            -29.148345
          ],
          [
            -67.49215,
            -29.150579
          ],
          [
            -67.491987,
            -29.151174
          ],
          [
            -67.492342,
            -29.151869
          ],
          [
            -67.49334,
            -29.152102
          ],
          [
            -67.493626,
            -29.152609
          ],
          [
            -67.491337,
            -29.153715
          ],
          [
            -67.491055,
            -29.154035
          ],
          [
            -67.491035,
            -29.154708
          ],
          [
            -67.491901,
            -29.157396
          ]
        ],
        type: 'LineString'
      }
    }
  ],
  waypoints: [
    {
      distance: 6.167,
      name: 'Castro y Bazán',
      location: [
        -67.491901,
        -29.157396
      ]
    },
    {
      distance: 8.871,
      name: 'Juan XXIII',
      location: [
        -67.506482,
        -29.156509
      ]
    },
    {
      distance: 7.935,
      name: 'Manzana O',
      location: [
        -67.527527,
        -29.142907
      ]
    },
    {
      distance: 6.167,
      name: 'Castro y Bazán',
      location: [
        -67.491901,
        -29.157396
      ]
    }
  ],
  code: 'Ok',
  uuid: 'OFHtQpcbx9km-iaEwLrkhQ0-snQV6J9MWHCOcDQN_lK2HEh68JHCBQ=='
};
